# WrongFabricSheetLayoutPattern Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..WrongFabricSheetLayoutPattern Property
BuiltInFailures..::..FabricFailures Class See Also
---
The Layout Pattern cannot accommodate the current data. Try decreasing the Number of Wires/Spacing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WrongFabricSheetLayoutPattern { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WrongFabricSheetLayoutPattern As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WrongFabricSheetLayoutPattern {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace